---
type: ExternalFileUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ExternalFileUtils

`Autodesk.Revit.DB.ExternalFileUtils` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAllExternalFileReferences | 2012 | `public static ICollection < ElementId > GetAllExternalFileReferences ( Document aDoc )` |
| Method | GetExternalFileReference | 2012 | `public static ExternalFileReference GetExternalFileReference ( Document aDoc , ElementId elemId )` |
| Method | GetFileBasedTempFolder | 2012 | `public static string GetFileBasedTempFolder ( string filename )` |
| Method | IsExternalFileReference | 2012 | `public static bool IsExternalFileReference ( Document aDoc , ElementId elemId )` |